Revit 2027 API
FailuresProcessingEventArgs Methods
The FailuresProcessingEventArgs type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFailuresAccessor |  Provides access to the failure information in the document.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetProcessingResult |  Retrieves current status of the failures processing result.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
SetProcessingResult |  Sets the result of the failures processing accomplished during this event callback.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace